{
  "projects": [
    {
      "title": "MSM",
      "type": "Business Contact Page",
      "icons": ["website"],
      "link1": "",
      "link2": "",
      "desc": "A website built for Marine Services and Management(a marine company based in Florida) using React for a dynamic, component-based structure. It features five pages: Home, About, Projects, FAQs, and Contact, with the Contact page utilizing Web3Forms for secure form submissions. Optimized with Vite for fast loading, the site showcases the company’s expertise and services while ensuring smooth, interactive user experiences across all devices.",
      "lang": ["Vite", "React", "Web3Forms", "FileZilla"],
      "imgs": [
        "/Personal-Portfolio/assets/pp-ga.png",
        "/Personal-Portfolio/assets/pp-p.png"
      ]
    },
    {
      "title": "Press Play",
      "type": "Game Library & Profile",
      "icons": "github",
      "link1": "https://pressplaydemo.netlify.app/",
      "link2": "https://github.com/Breideva/press-play",
      "desc": "A project utilizing the RAWG API to create an interactive video game library, allowing users to explore and discover games from a vast database. The platform features a profile system that leverages local storage to save users' favorite games, providing a personalized experience. Built with React and Tailwind CSS, the site offers a responsive design, smooth navigation, and engaging animations powered by GSAP and Swiper, ensuring a dynamic and enjoyable user experience.",
      "lang": ["React", "TailwindCss", "GSAP", "Swiper", "RAWG API"]
    },
    {
      "title": "Card Quest",
      "type": "Interactive Card Game",
      "icons": "github",
      "link1": "https://cardquestdemo.netlify.app/",
      "link2": "https://github.com/Breideva/CardQuest",

      "desc": "This project reimagines the classic card game Ride the Bus with a dynamic, interactive digital version built entirely using JavaScript for all game functionality. The game features intuitive controls, smooth animations, and a point-scoring system where users can draw cards, make decisions, and track their progress. Designed to be simple and fun, the game includes easy-to-understand rules at the start, allowing anyone to jump in and try to top their score.",
      "lang": ["Javascript", "GSAP"]
    },
    {
      "title": "Feed Me Flavor",
      "type": "Recipe Library",
      "icons": "github",
      "link1": "https://feedmeflavordemo.netlify.app/",
      "link2": "https://github.com/Breideva/FeedMeFlavor",

      "desc": "Using this project as a gateway to APIs, I chose the Spoonacular API to build a dynamic recipe library, giving users access to a wide variety of recipes, ingredients, and nutritional information. Built with React and styled using Tailwind CSS, the site features a clean, easy-to-use UI that’s responsive across devices. The app fetches data from the API to display detailed recipes, with added animations and interactive carousels from Swiper to enhance the user experience.",
      "lang": ["React", "TailwindCss", "GSAP", "Swiper", "Spoonacular API"]
    },
    {
      "title": "Wild Roots Nature",
      "type": "Conservation Hub",
      "icons": "github",
      "link1": "https://wildrootsnaturedemo.netlify.app/",
      "link2": "https://github.com/Breideva/Wild-Roots-Nature",

      "desc": "A website built with Vite and TypeScript, designed to raise awareness about the importance of protecting the Amazon rainforest. The site provides informative content on the environmental challenges faced by the Amazon and the efforts needed to preserve it. It also includes a donation feature, allowing users to contribute funds to support conservation initiatives, making it easy for visitors to help make a difference and support a vital cause.",
      "lang": ["Vite", "TypeScript", "Bootstrap", "TailwindCss", "GSAP"]
    },
    {
      "title": "Mr.8Ball",
      "type": "Interactive Magic 8-Ball",
      "icons": "github",
      "link1": "https://mr8ball.netlify.app/",
      "link2": "https://github.com/Breideva/Mr.8Ball",

      "desc": "The project features an interactive 8-Ball that generates responses to interrogative questions, providing users with a fun and engaging experience. The site allows users to input any question and receive randomized answers. The application uses JavaScript to handle the logic behind generating responses, delivering a smooth and playful experience for users across all devices.",
      "lang": ["Javascript"],
      "imgs": [
        "/Personal-Portfolio/assets/8ball.png",
        "/Personal-Portfolio/assets/8ball.png"
      ]
    }
  ]
}
